In [1]:
import numpy as np
np.random.seed(42)

# Pandas Basics

In [2]:
import pandas as pd

> Pandas allows for fast analysis, data cleaning and preparation.
> Pandas excels in performance and productivity
* conda install pandas
_OR_
* pip install pandas

## Series

In [3]:
# Series is built on top of NumPy array

labels = ['a', 'b', 'c']
my_data = [1,2,3]

pd.Series(data=my_data, index=labels)

a    1
b    2
c    3
dtype: int64

In [4]:
# We can also pass Dictionary as data to Series
# In case of a dictionary, Pandas will automatically convert 'Key' as Index_Label and
# 'Value' as the corressponding Series Value

dic = { "First Name": "Rakshith", "Last Name" : "Ramagiri"}

In [5]:
dic

{'First Name': 'Rakshith', 'Last Name': 'Ramagiri'}

In [6]:
pd.Series(data=dic) # NOTE: Pass only the dictionary.

First Name    Rakshith
Last Name     Ramagiri
dtype: object

In [7]:
# we can also pass built-in function as data references to pd.Series

pd.Series(data=[sum, max, min])

0    <built-in function sum>
1    <built-in function max>
2    <built-in function min>
dtype: object

In [8]:
# Series Vectorized Operations tries to add elements by matching their index_labels

In [9]:
ser1 = pd.Series(data=[5,10,16], index=['a','b','c'])

In [10]:
ser2 = pd.Series(data=[3,7,9], index=['b','c','d'])

In [11]:
ser1 + ser2 # will add all matching index_label values, 
            # if no matching index_label is found, then it returns 'NaN'

a     NaN
b    13.0
c    23.0
d     NaN
dtype: float64

In [12]:
# NOTE: all integer types are automatically converted to 'float64' type

## DataFrames

In [13]:
from numpy.random import randn

In [14]:
df = pd.DataFrame(data=randn(5,4), index=['Row A','Row B','Row C','Row D','Row E'], columns=['Col 1','Col 2','Col 3','Col 4'])

In [15]:
# use head() method to display first five entries in the DataFrame

df.head()

          Col 1     Col 2     Col 3     Col 4
Row A  0.496714 -0.138264  0.647689  1.523030
Row B -0.234153 -0.234137  1.579213  0.767435
Row C -0.469474  0.542560 -0.463418 -0.465730
Row D  0.241962 -1.913280 -1.724918 -0.562288
Row E -1.012831  0.314247 -0.908024 -1.412304

In [16]:
# use info() to learn about the total entries and other details about the DataFrame

df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, Row A to Row E
Data columns (total 4 columns):
Col 1    5 non-null float64
Col 2    5 non-null float64
Col 3    5 non-null float64
Col 4    5 non-null float64
dtypes: float64(4)
memory usage: 200.0+ bytes

In [17]:
df

          Col 1     Col 2     Col 3     Col 4
Row A  0.496714 -0.138264  0.647689  1.523030
Row B -0.234153 -0.234137  1.579213  0.767435
Row C -0.469474  0.542560 -0.463418 -0.465730
Row D  0.241962 -1.913280 -1.724918 -0.562288
Row E -1.012831  0.314247 -0.908024 -1.412304

In [18]:
# DataFrame is simply a bunch of Series that share the same indices

In [19]:
df['Col 1']

Row A    0.496714
Row B   -0.234153
Row C   -0.469474
Row D    0.241962
Row E   -1.012831
Name: Col 1, dtype: float64

In [20]:
type(df['Col 1']) # we can confirm the above statement using 'type()'

pandas.core.series.Series

In [21]:
type(df)

pandas.core.frame.DataFrame

In [22]:
# Selecting only a few columns
df[['Col 2', 'Col 4']]

          Col 2     Col 4
Row A -0.138264  1.523030
Row B -0.234137  0.767435
Row C  0.542560 -0.465730
Row D -1.913280 -0.562288
Row E  0.314247 -1.412304

In [23]:
# Creating new columns inside an existing DataFrame.

df['new'] = df['Col 3'] + df['Col 4'] # similar to creating a new 'Key-Value' pair in dictionary

In [24]:
df

          Col 1     Col 2     Col 3     Col 4       new
Row A  0.496714 -0.138264  0.647689  1.523030  2.170718
Row B -0.234153 -0.234137  1.579213  0.767435  2.346648
Row C -0.469474  0.542560 -0.463418 -0.465730 -0.929147
Row D  0.241962 -1.913280 -1.724918 -0.562288 -2.287205
Row E -1.012831  0.314247 -0.908024 -1.412304 -2.320328

In [25]:
# we can also DROP existing columns in DataFrame.

# Remove comment to see the 'Error'

#df.drop('new') # axis = 0 # by Default, DataFrame axis is set to ROW,
               # we need to change it to COLUMN to delete columns i.e, axis = 1

In [26]:
df.drop('new', axis=1) # this doesn't actually affect the DataFrame. Because 'drop' is not 'inplace' by default.

          Col 1     Col 2     Col 3     Col 4
Row A  0.496714 -0.138264  0.647689  1.523030
Row B -0.234153 -0.234137  1.579213  0.767435
Row C -0.469474  0.542560 -0.463418 -0.465730
Row D  0.241962 -1.913280 -1.724918 -0.562288
Row E -1.012831  0.314247 -0.908024 -1.412304

In [27]:
df.drop('new', axis=1, inplace=True) # this permanentely affects the DataFrame.

In [28]:
df # changes permanent

          Col 1     Col 2     Col 3     Col 4
Row A  0.496714 -0.138264  0.647689  1.523030
Row B -0.234153 -0.234137  1.579213  0.767435
Row C -0.469474  0.542560 -0.463418 -0.465730
Row D  0.241962 -1.913280 -1.724918 -0.562288
Row E -1.012831  0.314247 -0.908024 -1.412304

In [29]:
df.shape # to show DataFrame dimensions

(5, 4)

In [30]:
# as a result 'AXIS = 0' refers to 'ROWS' and 'AXIS = 1' refers to 'COLUMNS'

### Selecting ROWS in DataFrame.

In [31]:
# Label-based ROW selection

df.loc['Row A'] # 'loc' is a DataFrame method, yet it uses square_brackets '[]' weird??

Col 1    0.496714
Col 2   -0.138264
Col 3    0.647689
Col 4    1.523030
Name: Row A, dtype: float64

In [32]:
# as we can observe, the returned item is also a pd.Series object

In [33]:
# Index-based ROW selection

df.iloc[0]

Col 1    0.496714
Col 2   -0.138264
Col 3    0.647689
Col 4    1.523030
Name: Row A, dtype: float64

### Selecting Single Values in DataFrame

In [34]:
# Obtaining a single value.

df.loc['Row A', 'Col 1']

0.4967141530112327

In [35]:
# Obtaining sub-DataFrame from a DataFrame.

df.loc[ ['Row A', 'Row D'] , ['Col 2', 'Col 3']] # loc[ [ROW_SELECTION] , [COLUMN_SELECTION] ]

          Col 2     Col 3
Row A -0.138264  0.647689
Row D -1.913280 -1.724918

## Conditional Selection in Pandas

In [36]:
df > 0  # We get a boolean value for each cell, filled after each respective conditional check

       Col 1  Col 2  Col 3  Col 4
Row A   True  False   True   True
Row B  False  False   True   True
Row C  False   True  False  False
Row D   True  False  False  False
Row E  False   True  False  False

In [37]:
df[df > 0] # passing a boolean DataFrame will result in 'NaN' values in place of 'False' values (during comparisons)

          Col 1     Col 2     Col 3     Col 4
Row A  0.496714       NaN  0.647689  1.523030
Row B       NaN       NaN  1.579213  0.767435
Row C       NaN  0.542560       NaN       NaN
Row D  0.241962       NaN       NaN       NaN
Row E       NaN  0.314247       NaN       NaN

In [38]:
# To obtain a Series object after comparison

df['Col 4'] > 0

Row A     True
Row B     True
Row C    False
Row D    False
Row E    False
Name: Col 4, dtype: bool

In [39]:
# We generally apply conditional selection operation on a particular Column or Row
# to select only certain Rows or Columns of the DataFrame that satisfy the conditional statement.

df[ df['Col 4'] > 0] # this statement results in new DataFrame with conditional selection of Rows and Columns

          Col 1     Col 2     Col 3     Col 4
Row A  0.496714 -0.138264  0.647689  1.523030
Row B -0.234153 -0.234137  1.579213  0.767435

In [40]:
# In above result, 'Row C', 'Row D', 'Row E' has been eliminated since it's 'Col 4' value was not greater than '0'

In [41]:
df[df['Col 4'] > 0][['Col 1', 'Col 2']] # selecting required columns from resulting DataFrame of conditional operation on 'df'

          Col 1     Col 2
Row A  0.496714 -0.138264
Row B -0.234153 -0.234137

## Multiple Conditional Selections on DataFrame

In [42]:
# following operation will result in a error

df[ (df['Col 4'] > 0) and (df['Col 3'] > 0) ]

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [43]:
# this happens because, python's 'and' operator can only work with one pair Boolean objects only.
# i.e,

True and False

False

In [44]:
# But, in ** df[ (df['Col 4'] > 0) and (df['Col 3'] > 0) ] **
# we are trying operate on an entire DataFrame, hence the ValueError

In [45]:
# instead we can use '&' ampersand (for 'AND' operation) to join multiple conditions.
# '|' pipe operator for 'OR' operation.

df[ (df['Col 4'] > 0) & (df['Col 3'] > 0) ] # joining with 'AND' operator '&'

          Col 1     Col 2     Col 3     Col 4
Row A  0.496714 -0.138264  0.647689  1.523030
Row B -0.234153 -0.234137  1.579213  0.767435

In [46]:
df[ (df['Col 4'] > 0) | (df['Col 3'] > 0) ] # joining with 'OR' operator '|'

          Col 1     Col 2     Col 3     Col 4
Row A  0.496714 -0.138264  0.647689  1.523030
Row B -0.234153 -0.234137  1.579213  0.767435

## Setting and Resetting Index

In [47]:
df.reset_index() # to reset ROW index

   index     Col 1     Col 2     Col 3     Col 4
0  Row A  0.496714 -0.138264  0.647689  1.523030
1  Row B -0.234153 -0.234137  1.579213  0.767435
2  Row C -0.469474  0.542560 -0.463418 -0.465730
3  Row D  0.241962 -1.913280 -1.724918 -0.562288
4  Row E -1.012831  0.314247 -0.908024 -1.412304

In [48]:
# like most DataFrame operations, 'reset_index()' doesn't affect the original DataFrame.
# SET 'inplace' parameter to 'True' to affect the DataFrame permanently.

In [49]:
# As seen above, resetting using reset_index() will add a new 'index' column which stores old index's

In [50]:
df_newindex = df.reset_index()

In [51]:
df_newindex

   index     Col 1     Col 2     Col 3     Col 4
0  Row A  0.496714 -0.138264  0.647689  1.523030
1  Row B -0.234153 -0.234137  1.579213  0.767435
2  Row C -0.469474  0.542560 -0.463418 -0.465730
3  Row D  0.241962 -1.913280 -1.724918 -0.562288
4  Row E -1.012831  0.314247 -0.908024 -1.412304

In [52]:
# Setting a new index

df_newindex.set_index('index')

          Col 1     Col 2     Col 3     Col 4
index
Row A  0.496714 -0.138264  0.647689  1.523030
Row B -0.234153 -0.234137  1.579213  0.767435
Row C -0.469474  0.542560 -0.463418 -0.465730
Row D  0.241962 -1.913280 -1.724918 -0.562288
Row E -1.012831  0.314247 -0.908024 -1.412304

In [53]:
# set_index() method overwrites any existing 'index' of the DataFrame

In [54]:
df_newindex

   index     Col 1     Col 2     Col 3     Col 4
0  Row A  0.496714 -0.138264  0.647689  1.523030
1  Row B -0.234153 -0.234137  1.579213  0.767435
2  Row C -0.469474  0.542560 -0.463418 -0.465730
3  Row D  0.241962 -1.913280 -1.724918 -0.562288
4  Row E -1.012831  0.314247 -0.908024 -1.412304

In [55]:
# as with many DataFrame methods, the operations are not 'inplace' by default.

## Multi-Index and Index Hierarchy

In [56]:
# creating a multi-level indexed DataFrame.

outer_index = ['L1','L1','L2','L2']
inner_index = [1,2,1,2]
comb_index = list(zip(outer_index, inner_index))

# creating a Index Hierarchy using Pandas built-in function

index = pd.MultiIndex.from_tuples(comb_index)

In [57]:
index

MultiIndex(levels=[['L1', 'L2'], [1, 2]],
           labels=[[0, 0, 1, 1], [0, 1, 0, 1]])

In [58]:
df = pd.DataFrame(data=np.random.randn(4,2), index=index, columns=['A','B'])

In [59]:
df

             A         B
L1 1  1.465649 -0.225776
   2  0.067528 -1.424748
L2 1 -0.544383  0.110923
   2 -1.150994  0.375698

In [60]:
df.loc['L1']

          A         B
1  1.465649 -0.225776
2  0.067528 -1.424748

In [61]:
df.index.names # to list index column names.

FrozenList([None, None])

In [62]:
df.index.names = ['Levels', 'Number']

In [63]:
df # now index labels have been added

                      A         B
Levels Number
L1     1       1.465649 -0.225776
       2       0.067528 -1.424748
L2     1      -0.544383  0.110923
       2      -1.150994  0.375698

In [64]:
df.loc['L2'].loc[2, 'B']

0.37569801834567196

In [65]:
# splitting the above step.
# STEP 1 : Selecting a sub-DataFrame of the required Level

df.loc['L2']

               A         B
Number
1      -0.544383  0.110923
2      -1.150994  0.375698

In [66]:
# STEP 2 : Selecting the appropriate ROW from the sub-DataFrame

df.loc['L2'].loc[2]

A   -1.150994
B    0.375698
Name: 2, dtype: float64

In [67]:
# STEP 3 : Finally selecting the required COLUMN from the ROW.

df.loc['L2'].loc[2, 'B']

0.37569801834567196

### Cross Section

In [68]:
df.xs(key='L1') # To select a top-level index

               A         B
Number
1       1.465649 -0.225776
2       0.067528 -1.424748

In [69]:
df.xs(key=1, level='Number') # to select inner-index = '1' from all outer-indices

               A         B
Levels
L1      1.465649 -0.225776
L2     -0.544383  0.110923

In [70]:
# Practice examples

df.xs(key=2, level='Number') # obtains ROW 2 values for all outer indices

               A         B
Levels
L1      0.067528 -1.424748
L2     -1.150994  0.375698

## Missing Values

In [71]:
# Creating DataFrame using dictionaries.

d = {'A': [1,2,np.nan], 'B': [5, np.nan, np.nan], 'C': [1,2,3]}

In [72]:
df = pd.DataFrame(d)

In [73]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [74]:
# dropping missing values (NA or NaN)

df.dropna(axis=0) # by default, AXIS = 0

     A    B  C
0  1.0  5.0  1

In [75]:
df.dropna(thresh=2, axis=0) # minimum number of non-NA/NaN values to prevent Pandas from dropping axis.

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [76]:
# filling NA/NaN values

df.fillna(value='Missing')

         A        B  C
0        1        5  1
1        2  Missing  2
2  Missing  Missing  3

In [77]:
df['A'].fillna(value=df['A'].mean()) # fill COLUMN A's missing values with MEAN value.

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

## Groupby

**Aggregate Function:** A function which takes in MULTIPLE values as INPUT and OUTPUT's a SINGLE value as the result.

**Groupby** allows to group together rows based off of a column-value and perform some-sort of an aggregate function on them.

In [78]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [79]:
df = pd.DataFrame(data)

In [80]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [81]:
# Groupby company

df.groupby('Company')

In [82]:
by_company = df.groupby('Company')

In [83]:
by_company.mean() # Pandas automatically ignores any non-numeric columns in the DataFrame

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [84]:
by_company.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [85]:
by_company.std() # standard deviation

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [86]:
by_company.sum().loc['FB'] # to obtain total sales of FACEBOOK

Sales    593
Name: FB, dtype: int64

In [87]:
# generally we combine all these steps into one line as follows:

df.groupby('Company').sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [88]:
# we generally use aggregate functions on numeric columns

In [89]:
# describe() method

df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [90]:
df.groupby('Company').describe().loc['FB'] # choosing specific index/label

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64

## Merging, Joining and Concatenating

In [91]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [92]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [93]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [94]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [95]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [96]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

### Concatenating

In [97]:
# In order to concatenate, the dimensions along the axis being concatenated should be a match.

pd.concat([df1,df2,df3], axis=0) # by default, AXIS=0

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [98]:
pd.concat([df1,df2,df3], axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

### Merging

In [99]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [100]:
left

    A   B key
0  A0  B0  K0
1  A1  B1  K1
2  A2  B2  K2
3  A3  B3  K3

In [101]:
right

    C   D key
0  C0  D0  K0
1  C1  D1  K1
2  C2  D2  K2
3  C3  D3  K3

In [102]:
# merging

pd.merge(left=left, right=right, on='key', how='inner') # by default how='inner' i.e, INNER JOIN

    A   B key   C   D
0  A0  B0  K0  C0  D0
1  A1  B1  K1  C1  D1
2  A2  B2  K2  C2  D2
3  A3  B3  K3  C3  D3

In [103]:
# inner join
# outer join
# left join
# right join

### Joining

In [104]:
# JOINING is a method for combining the columns of two potentially differently-indexed DataFrames into a 
# single result DataFrame.

In [105]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [106]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [107]:
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [108]:
left.join(other=right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [109]:
left.join(other=right, how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

## Operations

In [110]:
df = pd.DataFrame({'col1':[1,2,3,4],
                   'col2':[444,555,666,444],
                   'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

### unique(), nunique(), value_counts()

In [111]:
df['col2'].unique() # NumPy array of all unique values in the COLUMN

array([444, 555, 666], dtype=int64)

In [112]:
df['col2'].nunique() # Total count of all the unique values in the COLUMN

3

In [113]:
df['col2'].value_counts() # Total count of each unique value in the COLUMN of DATAFRAME

444    2
555    1
666    1
Name: col2, dtype: int64

In [114]:
df[df['col1'] > 2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [115]:
df[ (df['col1'] > 2) & (df['col2'] == 444)]

   col1  col2 col3
3     4   444  xyz

### apply()

In [116]:
# APPLY() function for DataFrame

df['col1'].apply(lambda x: x**2) # apply() method takes a function as a argument & applies it on each value in DataFrame

0     1
1     4
2     9
3    16
Name: col1, dtype: int64

In [117]:
df['col3'].apply(len) # applies len() on each value in 'COL3' in DataFrame

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [118]:
# we generally write LAMBDA expressions within the apply() method's argument passing space.

df['col2'].apply(lambda x: x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

### drop()

In [119]:
df.drop(labels='col1', axis=1) # default: AXIS=0

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [120]:
df.columns # to get a list of all COLUMNS in DataFrame

Index(['col1', 'col2', 'col3'], dtype='object')

In [121]:
df.index # to get the list of DataFrame's indices

RangeIndex(start=0, stop=4, step=1)

### sort_values(), isnull()

In [122]:
df.sort_values(by='col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [123]:
# to find null values in DataFrame

df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

### pivot_table()

In [124]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [125]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [126]:
df.pivot_table(values='D', index=['A', 'B'], columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [127]:
# values : the actually data to be used later on. (C as shown above)

# index : COLUMNS/ROWS to convert into indices. (A,B as shown above)

# columns : the COLUMNS to convert into DATA-COLUMNS. (x,y as shown above)

## Data Input and Output

* CSV
* Excel
* HTML
* SQL

In [128]:
pd.read_csv('example')

FileNotFoundError: File b'example' does not exist

In [129]:
df = pd.read_csv('example')

FileNotFoundError: File b'example' does not exist

In [130]:
df.to_csv('my_output', index=False) # index=False to prevent the index being written to output file

In [131]:
pd.read_csv('my_output')

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [132]:
# Pandas can only import text-based datal. It cannot however import images, formulas ..etc

### Reading Excel Data

In [133]:
pd.read_excel(io='Excel_Sample.xlsx', sheetname='Sheet1') # 'sheetname' to select a particular sheet from workbook

FileNotFoundError: [Errno 2] No such file or directory: 'Excel_Sample.xlsx'

In [134]:
df.to_excel(excel_writer='new_excel.xlsx', sheet_name='new_sheet') # writing a DataFrame to Excel Workbook

In [135]:
pd.read_excel(io='new_excel.xlsx')

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

### Reading HTML

In [136]:
# data = pd.read_html(io='https://www.fdic.gov/bank/individual/failed/banklist.html', encoding='UTF-8')

Pandas will scrap through the page and add any table element it finds into a LIST of DataFrames. In our case, data[0] should give one DataFrame, Data[1] another and so on.....

### Reading SQL

In [137]:
# Pandas not the best method to read data to DataFrames directly, use one of the many specialized lib's

In [138]:
from sqlalchemy import create_engine

In [139]:
engine = create_engine('sqlite:///:memory:') # creating a sqlite database in memory

In [140]:
df.to_sql(name='my_table', con=engine) # writing DataFrame to a new table in sqlite database created in last-step

In [141]:
sqldf = pd.read_sql(sql='my_table', con=engine) # read the contents from previously written table from Database.

In [142]:
sqldf

   index    A    B  C  D
0      0  foo  one  x  1
1      1  foo  one  y  3
2      2  foo  two  x  2
3      3  bar  two  y  5
4      4  bar  one  x  4
5      5  bar  one  y  1